# LuminousFlux Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..LuminousFlux Property
SpecTypeId Class See Also
---
Luminous Flux, in discipline Electrical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId LuminousFlux { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LuminousFlux As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LuminousFlux {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace